IDEA StatiCa Open Model
OpeningCirc Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The OpeningCirc type exposes the following members.
Properties
Name | Description
Diameter
 Diameter of opening
GeomId
 Id representing geometrical parts of Detail
 (Inherited from Opening.)
Id
 Element Id
 (Inherited from OpenElementId.)
InsertPoint
 Insert point 0 - 9
 (Inherited from Opening.)
MasterComponent
 Master component
 (Inherited from Opening.)
MasterPoint
 Master point 0 - 9
 (Inherited from Opening.)
Name
 Name
 (Inherited from Opening.)
Outline
 Outline of Oopening
 (Inherited from Opening.)
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
 (Inherited from Opening.)
Top
See Also
Reference
OpeningCirc Class
IdeaRS.OpenModel.Detail Namespace